//Constatnts
//≈Ã—«∆Ì… ·Õ”«» œ—Ã… «·Õ—«—…


 double g=9.81;//m/s^2  ”«—⁄ «·Ã«–»Ì… «·√—÷Ì…
 double Cd[2]={0.1234,0.1234};//À«»  «·„ﬁ«Ê„… «·‘ﬂ·Ì
 double A[]={141.42,176.71};//m^2 „”«Õ… «·”ÿÕ «·Ÿ«Â—Ì ··Ã”„ ÊÂÊ ﬁÿ⁄ ‰«ﬁ’ ‰’›« ﬁÿ—ÌÂ 15Ê15
 double totalMass=50;//«·ﬂ ·… «·ﬂ·Ì… ··„‰ÿ«œ
 double molarMassgaz=4.002602;
//double totalMassHe=30;//ﬂ ·… «·ÂÌ·ÌÊ„ ›Ì «·„‰ÿ«œ Ê›Ì «·„÷Œ…
double massBallon=50;//ﬂ ·… €·«› «·»«·Ê‰ Ê«· ÃÂÌ“«  «·⁄·„Ì…
double t=0.5;//sec  €Ì— «·“„‰ delta t
 double p0=101325;//Pa «·÷€ÿ «·ÃÊÌ «·ﬁÌ«”Ì ⁄‰œ ”ÿÕ «·»Õ—
 double l=0.0065;//K„⁄œ·  €Ì— œ—Ã… «·Õ—«—…
 double t0=288.15;//k œ—Ã… «·Õ—«—… «·ﬁÌ«”Ì… ⁄‰œ ”ÿÕ «·»Õ—      
 double molarMass=0.0289644;//Mol«·ﬂ ·… «·„Ê·Ì… ··ÂÊ«¡
 double R=8.31447;//J/(mol*K) À«»  «·€«“«  «·⁄«„
 double valumeBalloon=1400;//M^3 ÕÃ„ «·»«·Ê‰
 double tempreture[30]={288.3,281.65,275.15,268.66,262.17,255.68,249.19,242.7,236.21,292.73,223.25,220.12,217.95,216.90,216.75,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65,216.65};//œ—Ã… «·Õ—«—… „‰ ”ÿÕ «·√—÷ Õ Ï «— ›«⁄ 20 ﬂ„
 double pi=3.142857142;
//Vector3D w1(0,0,0),w2,w3,w4,w5,w6,w7,w8,w9,w10,w11,w12,w13,w14,w15,w16,w17,w18,w19,w20;
//={w1,w2,w3,w4,w5,w6,w7,w8,w9,w10,w11,w12,w13,w14,w15,w16,w17,w18,w19,w20};//«·—Ì«Õ „‰ ⁄·Ï ”ÿÕ «·√—÷ Õ Ï «— ›«⁄ 20 ﬂ„